Detection rule: Attempt_to_expose_user_credentials_to_dumping

Description: |
    This rule will trigger an alert when some registry modifications are made that could expose user's credentials to dumping.
    This actions could be to enable :
    - Wdigest authentication
    - LM hashes storage in SAM hive
    - adding SSPs"

Technique IDs: 
    - T1003
    - T1003.001

KQL query: |
    DeviceRegistryEvents
    | where (RegistryKey contains @"HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest" and RegistryValueName has "UseLogonCredential") //enable WDigest
    or (RegistryKey has @"HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Lsa" and RegistryValueName contains "NoLmHash") //re-enable stored LM hash
    or (RegistryKey has_any (@"HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Lsa\Security Packages",@"HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Lsa\OSConfig\Security Packages")) //Add SSP